// console.log ("привет")

//alert("Пока не нажмёшь ОК,"); //окно с сообщением
//alert("дальше страницу загружать не буду!!!");
//[1, 2].forEach(alert); //выводит по очереди 1,2

//var message; // объявим (создадим) переменную
//message='Пока не нажмёшь ОК, дальше страницу загружать не буду!!!'; // сохраним в переменной строку, т.е. запишем в переменную данные,
// иными словами сохраним данные в соответствующей области памяти
//alert(message); //выведем содержимое переменной


//var message; // объявим (создадим) переменную
//message='привет'; //задали значение
//message='Пока не нажмёшь ОК, дальше страницу загружать не буду!!!'; //заменили значение
//alert(message); //выведем измененное значение переменной (при этом старое зн-ие удаляется)


var hello = 'вот и настало время презинтации дипломной работы '; //объявили одну переменную и задали зн-ие
var name = 'Алеси Пашкевич'; // объявили вторую переменную
message = hello + name; // скопировали значение
alert( message.toUpperCase() ); //в отображенном окне вывели скопированное значение
// var message2 = 'Прошу любить и жаловать ;)';
// alert( message2 );

var sensei = prompt("Преподаватель", 'Владимир Каменков');

result = confirm('Прошу любить и жаловать ;)');

// var isAdmin = confirm("Вы - администратор?");
// alert( isAdmin );



//var a = (5,6);
//alert( a ); //6

//var x = 1 + (a *= 2); 
//alert( x ); //13
